In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('income.csv')
df.rename(columns={'hours-per-week':'hours'},inplace=True)
df.head(2)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K

In [3]:
df.income.unique()

array(['<=50K', '>50K'], dtype=object)

In [4]:
df.race.value_counts()

White                 41762
Black                  4685
Asian-Pac-Islander     1519
Amer-Indian-Eskimo      470
Other                   406
Name: race, dtype: int64

In [5]:
df.hours[(df.race=='White') & (df.income=='>50K')].mean()

45.551899688884696

In [6]:
df.hours[df.race=='Black'].mean()

38.59786552828175

# pivot table

In [7]:
pd.pivot_table(df, index=['race',],columns=['income','gender'],values=['hours'],aggfunc='mean')

                        hours
income                  <=50K                  >50K
gender                 Female       Male     Female       Male
race
Amer-Indian-Eskimo  36.682353  41.991837  41.933333  44.375000
Asian-Pac-Islander  36.540179  39.009063  41.797101  45.608824
Black               36.795496  38.977869  42.363636  44.788018
Other               35.472222  40.537736  42.727273  44.717949
White               35.668960  40.936604  40.457847  46.418423

# Group by

In [8]:
#index haman b ast
df.groupby(by=['gender','income']).agg(['mean','count']).age

                    mean  count
gender income
Female <=50K   36.278999  14423
       >50K    42.219333   1769
Male   <=50K   37.248548  22732
       >50K    44.641863   9918

# joining tables

In [9]:
df1=pd.DataFrame({'A':['A11','A12'],
                  'B':['B11','B12'],
                  'C':['C11','C12'],
                  'D':['D11','D12']},
                index=[0,1])
df2=pd.DataFrame({'A':['A1','A2','A3'],
                  'B':['B1','B2','B3'],
                  'C':['C1','C2','C3'],
                  'D':['D1','D2','D3']},
                index=[1,2,3])

In [10]:
df1

     A    B    C    D
0  A11  B11  C11  D11
1  A12  B12  C12  D12

In [11]:
df2

    A   B   C   D
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [12]:
pd.concat([df1,df2],axis=1,join='inner')

     A    B    C    D   A   B   C   D
1  A12  B12  C12  D12  A1  B1  C1  D1

In [13]:
pd.concat([df1,df2],axis=1,join='outer')

     A    B    C    D    A    B    C    D
0  A11  B11  C11  D11  NaN  NaN  NaN  NaN
1  A12  B12  C12  D12   A1   B1   C1   D1
2  NaN  NaN  NaN  NaN   A2   B2   C2   D2
3  NaN  NaN  NaN  NaN   A3   B3   C3   D3

# merge

In [14]:
 df1=pd.DataFrame({'id':[81010,81011,81012,81013],
                    'DA':[20,15,18.75,10],
                    'SI':[16,17,20,13],
                    'IL':[17,13,14,11]})
df2=pd.DataFrame({'id':[81011,81012,81013,81014,81015],
                  'GPA':[16.5,18,15,19.3,17.7],
                  'uni':['A0','A1','A2','A3','A5']})

In [15]:
df1

      id     DA  SI  IL
0  81010  20.00  16  17
1  81011  15.00  17  13
2  81012  18.75  20  14
3  81013  10.00  13  11

In [16]:
df2

      id   GPA uni
0  81011  16.5  A0
1  81012  18.0  A1
2  81013  15.0  A2
3  81014  19.3  A3
4  81015  17.7  A5

In [17]:
pd.merge(df1,df2,on='id',how='left')

      id     DA  SI  IL   GPA  uni
0  81010  20.00  16  17   NaN  NaN
1  81011  15.00  17  13  16.5   A0
2  81012  18.75  20  14  18.0   A1
3  81013  10.00  13  11  15.0   A2

# join

In [48]:
df1

      id     DA  SI  IL
0  81010  20.00  16  17
1  81011  15.00  17  13
2  81012  18.75  20  14
3  81013  10.00  13  11

In [49]:
df2

      id   GPA uni
0  81011  16.5  A0
1  81012  18.0  A1
2  81013  15.0  A2
3  81014  19.3  A3
4  81015  17.7  A5

In [52]:
df1.set_index('id').join(df2.set_index('id'),lsuffix='_left',rsuffix='2')

          DA  SI  IL   GPA  uni
id
81010  20.00  16  17   NaN  NaN
81011  15.00  17  13  16.5   A0
81012  18.75  20  14  18.0   A1
81013  10.00  13  11  15.0   A2

In [53]:
df1.set_index('id')

          DA  SI  IL
id
81010  20.00  16  17
81011  15.00  17  13
81012  18.75  20  14
81013  10.00  13  11